Tekla.Structures.ModelInternal.dotRebarHookData_t
Serialization structure for RebarHookData.

Tekla.Structures.ModelInternal.dotRebarHookData_t.Angle
The angle of the hook.

Tekla.Structures.ModelInternal.dotRebarHookData_t.Radius
The bending radius of the hook.

Tekla.Structures.ModelInternal.dotRebarHookData_t.Length
The length of the straight part of the hook.

Tekla.Structures.ModelInternal.dotRebarHookData_t.Shape
The shape of the hook.